#============================================================================
#   AOS内核的内存挂载点
#----------------------------------------------------------------------------
# 这个值必须存在且相等在文件"loader.inc"中的 'KernelEntryPointPhyAddr'！
EntryPoint     = 0x1000
#============================================================================


# ======================================================================================================================
# ----------------------------------------------------------------------------------------------------------------------
# 一些变量
# ----------------------------------------------------------------------------------------------------------------------386

# 头文件目录
i = include

# C文件所在目录
sk = src/kernel

# 编译链接中间目录
t = target
tb = $t/boot
tk = $t/kernel

# 所需软盘镜像，可以指定已存在的软盘镜像，系统内核将被写入到这里
Img = AOS.img
# 硬盘镜像 -- 还没有


# 镜像挂载点，自指定，必须存在于自己的计算机上，没有请自己创建一下
ImgMountPoint = /mnt/floppy

# 所需要的编译器以及编译参数
ASM             = nasm
CC              = gcc
LD              = ld
ASMFlagsOfBoot  = -I src/boot/include/
ASMFlagsOfKernel= -f elf -I $(sk)/
CFlags          = -c -I$i -fno-builtin -Wall
LDFlags         = -Ttext $(EntryPoint) -Map kernel.map
# ======================================================================================================================


# ======================================================================================================================
# ----------------------------------------------------------------------------------------------------------------------
#   目标程序以及编译的中间文件
# ----------------------------------------------------------------------------------------------------------------------
AOSBoot      = $(tb)/boot.bin $(tb)/loader.bin
AOSKernel    = $(tk)/kernel.bin

# 内核，只实现基本功能
KernelObjs      = $(tk)/kernel.o $(tk)/main.o $(tk)/kernel_386lib.o

Objs            = $(KernelObjs)
# ======================================================================================================================


# ======================================================================================================================
# ----------------------------------------------------------------------------------------------------------------------
# 所有的功能伪命令，需要严格的制表符
# ----------------------------------------------------------------------------------------------------------------------
.PHONY: nop all image debug run clean realclean
# 默认选项（输入make但没有跟参数，自动执行），提示一下用户我们的makefile有哪些功能
nop:
	@echo "all              编译所有文件，生成目标文件(二进制文件，boot.bin)"
	@echo "image            生成系统镜像文件"
	@echo "debug            打开bochs进行系统的运行和调试"
	@echo "run              提示用于如何将系统安装到虚拟机上运行"
	@echo "clean            清理所有的中间编译文件"
	@echo "realclean        完全清理：清理所有的中间编译文件以及生成的目标文件（二进制文件）	"

# 编译所有文件
all: $(AOSBoot) $(AOSKernel) # 这表示依赖的东西
	@echo "已经生成 AOS 内核！"

# 生成系统镜像文件
image: $(Img) $(AOSBoot)
	dd if=$(tb)/boot.bin of=$(Img) bs=512 count=1 conv=notrunc
	sudo mount $(Img) $(ImgMountPoint) -o loop
	sudo cp -fv $(tb)/loader.bin $(ImgMountPoint)
	sudo cp -fv $(AOSKernel) $(ImgMountPoint)
	sudo umount $(ImgMountPoint)

# 打开 bochs 进行系统的运行和调试
debug: $(Img)
	bochs -q

# 运行Flyanx系统：打印提示信息
run: $(Img)
	@qemu-system-i386 -drive file=$(Img),if=floppy
	@echo "你还可以使用Vbox等虚拟机挂载.img软盘，即可开始运行！"

# 更新映像并运行
uprun: $(Img) image run

# 更新映像并运行
updebug: $(Img) image debug

# 清理所有的中间编译文件
clean:
	@echo "中间文件清理完毕"

# 完全清理：清理所有的中间编译文件以及生成的目标文件（二进制文件）
realclean: clean
	-rm -f $(AOSBoot) $(AOSKernel)
# ======================================================================================================================


# ======================================================================================================================
# ----------------------------------------------------------------------------------------------------------------------
#   目标文件生成规则
# ----------------------------------------------------------------------------------------------------------------------
# 软盘镜像文件不存在，应该怎么生成？  生成规则
$(Img):
	dd if=/dev/zero of=$(Img) bs=512 count=2880

# 引导程序的生成规则
$(tb)/boot.bin: src/boot/include/fat12hdr.inc
$(tb)/boot.bin: src/boot/boot.asm
	$(ASM) $(ASMFlagsOfBoot) -o $@ $<

# 加载程序Loader
$(tb)/loader.bin: src/boot/include/fat12hdr.inc
$(tb)/loader.bin: src/boot/include/load.inc
$(tb)/loader.bin: src/boot/loader.asm
	$(ASM) $(ASMFlagsOfBoot) -o $@ $<

# 内核
$(AOSKernel): $(Objs)
	$(LD) $(LDFlags) -o $(AOSKernel) $^
# ======================================================================================================================


#============================================================================
#   中间Obj文件生成规则
#----------------------------------------------------------------------------
# ======= 内核  =======
$(tk)/kernel.o: $(sk)/kernel.asm
	$(ASM) $(ASMFlagsOfKernel) -o $@ $<

$(tk)/kernel_386lib.o: $(sk)/kernel_386lib.asm
	$(ASM) $(ASMFlagsOfKernel) -o $@ $<

$(tk)/main.o: $(sk)/main.c
	$(CC) $(CFlags) -o $@ $<

#============================================================================